app/controllers/documents_helper_controller.rb

SELECT "comunas".* FROM "comunas"
DELETE FROM "sectors"
INSERT INTO "sectors" ("nombre", "sector", "comuna_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "CALETA BUENA"], ["sector", "ICB"], ["comuna_id", 5], ["created_at", "2015-01-29 00:53:04.328812"], ["updated_at", "2015-01-29 00:53:04.328812"]]
---
	def read_sectors
		json = xls_to_json	'public/uploads/document/sector.xlsx'
		comunas = Comuna.all
		Sector.delete_all
		json.each do |data|
			unless data["nombre_comuna"].nil?
				comuna = comunas.select{|comuna| comuna.nombre.casecmp(data["nombre_comuna"]) == 0}.first
				Sector.create(nombre: data["nombre_sector"], sector: data["cod_sector"], comuna: comuna)

DELETE FROM "comunas"
INSERT INTO "comunas" ("nombre", "provincia_id", "id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Arica\r"], ["provincia_id", 1], ["id", 1], ["created_at", "2015-01-29 00:45:58.295284"], ["updated_at", "2015-01-29 00:45:58.295284"]]
---
	def read_comunas
		json = csv_to_json	'public/uploads/document/comunas.csv'
		Comuna.delete_all
		json.each do |data|
			p data
			Comuna.create(nombre: data["nombre"], provincia_id: data["provincia_id"], id: data["id"])

DELETE FROM "regions"
INSERT INTO "regions" ("id", "numero", "nombre", "titulo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 1], ["numero", "Primera"], ["nombre", "I"], ["titulo", "Región De Tarapacá"], ["created_at", "2015-01-28 23:54:31.769537"], ["updated_at", "2015-01-28 23:54:31.769537"]]
---
	def read_regions
		json = csv_to_json 'public/uploads/document/regions.csv'
		Region.all.delete
		json.each do |data|
			Region.create(data)