app/controllers/documents_controller.rb

INSERT INTO "documents" ("name", "document", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hola"], ["document", "Screen_Shot_2015-01-27_at_9.21.25_PM.png"], ["created_at", "2015-01-28 20:51:01.630733"], ["updated_at", "2015-01-28 20:51:01.630733"]]
---
  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save